Repository: argrath/activitystreams
Catalog: omegat/omegat/project_save.tmx
Source language: en
Languages: ja

source: This document was published by the Social Web Working Group as a Recommendation.
ja: この文書は Social Web Working Group によって 勧告として発行された。

source: This draft is heavily influenced by the JSON Activity Streams 1.0 specification originally co-authored by Martin Atkins, Will Norris, Chris Messina, Monica Wilkinson, Rob Dolin and James Snell.
ja: この草稿は、Martin Atkins、Will Norris、Chris Messina、Monica Wilkinson、Rob Dolin、James Snellの共著によるJSON Activity Streams 1.0仕様の影響を強く受けている。

source: This enhances the functionality and interoperability of the Web.
ja: これは、Webの機能性と相互運用性を向上させる。

source: This is a Japanese translation of Activity Streams 2.0.
ja: これはActivity Streams 2.0の参考日本語訳です。

source: This is a Japanese translation of Activity Vocabulary.
ja: これはActivity Vocabularyの日本語訳です。

source: This is intentional.
ja: これは意図的である。

source: This is specified using the following [ABNF] syntax description.
ja: これは以下の [ABNF] 文法記述を使って指定される。

source: This mechanism may not be understood by implementations that do not choose to process Activity Streams 2.0 documents using JSON-LD.
ja: この機構は、JSON-LD を使って Activity Streams 2.0 文書を処理することを 選ばなかった実装によっては理解されないかもしれない。

source: This property will typically be used to provide the URL to an image (e.g. JPEG, GIF or PNG) resource that can be displayed to the user.
ja: この属性は通常、ユーザに表示可能なイメージ(JPEG、GIF、PNGなど)リソースへのURLを提供するために使われる。

source: This specification builds upon that initial foundation by incorporating lessons learned through extensive implementation, community feedback and related ongoing work from a variety of other communities.
ja: この仕様は、広範な実装、コミュニティのフィードバック、および他のさまざまなコミュニティからの関連する進行中の作業を通じて学んだ教訓を組み込むことによって、その初期の基盤の上に構築されている。

source: This specification describes a JSON-based [RFC7159] serialization syntax for the Activity Vocabulary that conforms to a subset of [JSON-LD] syntax constraints but does not require JSON-LD processing.
ja: この仕様は、[JSON-LD] 制限の部分集合に準拠するが JSON-LD 処理を要求しない Activity Vocabulary のための JSON [RFC7159] ベースの直列化を記述する。

source: This specification describes the Activity vocabulary.
ja: この仕様は Activity vocabulary について記述する。

source: This specification details a model for representing potential and completed activities using the JSON format.
ja: この仕様では、JSON形式を使って、潜在的なアクティビティと完了したアクティビティを表現するためのモデルについて詳しく説明する。

source: This specification intentionally defines Actors in only the most generalized way, stopping short of defining semantically specific properties for each.
ja: この仕様書は意図的に Actor を最も一般的な形でのみ定義し、 それぞれについて意味論的に特定の属性を定義することまではしない。

source: This specification registers the application/activity+json MIME Media Type specifically for identifying documents conforming to the Activity Streams 2.0 format.
ja: この仕様は、Activity Streams 2.0 型式に準拠した文書を識別するために application/activity+json MIME Media Type を 登録する。

source: This specification stops short of defining semantically specific properties for most of these activities.
ja: この仕様は、これらのアクティビティのほとんどについて特定の属性を 意味論的に定義するには至っていない。

source: This specification stops short of defining semantically specific properties for most of these objects.
ja: この仕様は、これらのアクティビティのほとんどについて特定の属性を 意味論的に定義するには至っていない。

source: This specification uses IRIs [RFC3987].
ja: この仕様は IRI [RFC3987] を 使っている。

source: To promote interoperability, Activity Streams 2.0 implementations MUST only use link relations that are syntactically valid in terms of both the [RFC5988] and [HTML5] definitions.
ja: 相互運用性を促進するために、Activity Streams 2.0実装は、[RFC5988]と[HTML5]の両方の定義に関して構文的に有効なリンク関係のみを使わなければならない。

source: Unification of "verb" and "objectType" to "type"
ja: "verb" と "objectType" の "type" への統一

source: Unless otherwise specified, all properties defined as xsd:dateTime values MUST conform to the rules defined in Activity Streams 2.0 Core, Section 2.3.
ja: 特に指定がない限り、 xsd:dateTime 値として定義されている全ての属性は Activity Streams 2.0 Core, Section 2.3 で 定義されている規則に従わなければならない(MUST)。

source: Used to represent distinct subsets of items from a Collection.
ja: Collectionからの項目の異なる部分集合を表すために使われる。

source: Used to represent ordered subsets of items from an OrderedCollection.
ja: OrderedCollectionからの項目の順序付き部分集合を表すために使用されます。

source: Using paging with an OrderedCollection can be tricky because there are no guarantees that implementations will process the sequence of pages in any predictable order.
ja: OrderedCollection のページングはトリッキーな場合がある; 実装がページの並びを何らかの推測可能な順序で処理することが 保証されないからである。

source: VCard [ vcard-rdf] SHOULD be used to provide additional metadata for Person, Group, and Organization instances.
ja: Person, Group, Organization 実体の 追加メタデータとして提供するために VCard [[vcard-rdf]] が使われるべきである(SHOULD)。

source: Value
ja: 値

source: When a Link is used, it establishes a qualified relation connecting the subject (the containing object) to the resource identified by the href.
ja: Link が使われるとき、 主題 (含んでいるオブジェクト) を href で 識別されるリソースと接続する 修飾された関係(qualified relation) を確立する。

source: When a JSON-LD enabled Activity Streams 2.0 implementation encounters a JSON document identified using the " application/activity+json" MIME media type, and that document does not contain a @context property whose value includes a reference to the normative Activity Streams 2.0 JSON-LD @context definition, the implementation MUST assume that the normative @context definition still applies.
ja: JSON-LD を有効にした Activity Streams 2.0 実装が "application/activity+json" MIME メディアタイプを使って 識別された JSON ドキュメントに遭遇し、 そのドキュメントに標準的な Activity Streams 2.0 JSON-LD @context definition を参照する値を持つ @context 属性がない場合、 実装はそれでも標準的な @context 定義があるものと仮定しなければならない(MUST)。

source: When an implementation uses an extension type that overlaps with a core vocabulary type, the implementation MUST also specify the core vocabulary type.
ja: 実装がコア語彙型と重複する拡張型を使用する場合、実装はコア語彙型も指定しなければならない(MUST)。

source: When encountered in an Activity Streams 2.0 document, they SHOULD be processed in accordance to the guidelines listed in B. Deprecated Activity Streams 1.0 Syntax
ja: Activity Streams 2.0 文書でこれらに遭遇した場合、B. Deprecated Activity Streams 1.0 Syntaxに上げられているガイドラインに従って 処理されるべきである(SHOULD)。

source: When serialized, absent properties are represented by either (a) setting the property value to null, or (b) by omitting the property declaration altogether at the option of the publisher.
ja: 直列化されるとき、値の無い属性は、 (a) 属性の値を null に設定するか、 (b) 属性宣言自体を省略するかで表現され、 これは発行者の選択である。

source: When using [JSON-LD] mechanisms to produce or consume Activity Streams 2.0 documents, the @language property MAY be used within a @context to identify the default language.
ja: Activity Streams 2.0 文書を生成または処理するのに [JSON-LD] 機構を使う場合、 デフォルト言語を識別するために @context の中で @language 属性を使っても良い(MAY)。

source: Where such overlap exists, for the sake of consistent interoperability, implementations MUST favor the use of properties defined by the Activity Vocabulary.
ja: そのような重なりが存在する場所では、一貫した相互運用性のために、 Activity Vocabulary て定義されている属性の仕様を 優先しなければならない(MUST)。

source: Whether ordered or not, the pages of a Collection are typically arranged in a sequence (either a singly or doubly-linked list).
ja: 順序付きでも順序なしでも、 Collection のページは 並びに配置される (シングルリンクリストかダブルリンクリスト)。

source: While implementations are free to introduce new types of Activites beyond those defined by the Activity Vocabulary, interoperability issues can arise when applications rely too much on extension types that are not recognized by other implementations.
ja: 実装は、Activity Vocabularyによって定義されたものを超えた新しい型のActivityを自由に導入することができるが、アプリケーションが他の実装によって認識されない拡張型に過度に依存する場合、相互運用性の問題が生じる可能性がある。

source: While implementations are free to introduce new types of Actors beyond those defined by the Activity Vocabulary, interoperability issues can arise when applications rely too much on extension types that are not recognized by other implementations.
ja: 実装は、Activity Vocabularyによって定義されたものを超えて新しいタイプのアクターを自由に導入することができるが、アプリケーションが他の実装によって認識されない拡張タイプに過度に依存する場合、相互運用性の問題が生じる可能性がある。

source: While implementations are free to use such constructs as extensions within an Activity Streams 2.0 document, consumers that use the standard JSON-LD Processing Algorithms will be required to either ignore such extensions or map those to alternative compatible constructs prior to applying the JSON-LD algorithms.
ja: 実装はActivity Streams 2.0文書内の拡張としてこのような構造体を自由に使用できるが、標準のJSON-LD処理アルゴリズムを使用する消費者は、JSON-LDアルゴリズムを適用する前に、このような拡張を無視するか、互換性のある別の構造体にマッピングする必要がある。

source: While not all Activity Streams 2.0 implementations are expected to implement support for the Extended properties, all implementations MUST at least be capable of serializing and deserializing the Extended properties in accordance with the Activity Streams 2.0 Core Syntax.
ja: 全ての Activity Streams 2.0 実装が拡張属性対応を実装していることを 想定していないが、全ての実装は少なくとも Activity Streams 2.0 Core Syntax に従って拡張属性を直列化および直接化復元する能力が なければならない(MUST)。

source: While other serialization forms are possible, such alternatives are not discussed by this document.
ja: 他の直列化形式も可能であるが、そのような選択肢はこの文書では議論しない。

source: While such microsyntaxes MAY be used within the values of the content, name, and summary properties on an Activity Streams Object, implementations SHOULD NOT be required to parse the values of those properties in order to determine the appropriate routing of notifications, categorization or linking between objects.
ja: このようなマイクロ文法は、Activity Streams Objectの content, name, summary 属性の値の中で使われても良い(MAY)が、実装は、通知の適切なルーティング、分類、またはオブジェクト間のリンクを決定するために、これらの属性の値を解析することを要求されるべきではない(SHOULD NOT)。

source: While there are means (based on the action type, actor, object and target of the activity) to infer the primary audience for many types of activities, heuristics do not work in every case and do not provide a means of identifying the secondary audience.
ja: 多くの型のアクティビティに対して、 (アクティビティのアクション型、アクター、オブジェクト、対象を元にして) 主要関係者を推測する手段はあるものの、 経験則は全ての場合に働くわけではなく、補助関係者を識別する手段を提供しない。

source: While this is close to the original, the use of fully expanded URI label for the foo property is not ideal.
ja: これはオリジナルに近いが、foo属性に完全に展開されたURIラベルを使用するのは同一ではない。

source: Within JSON-LD, Compact URI prefixes are defined within the JSON-LD @context definition.
ja: JSON-LD内では、Compact URI接頭辞はJSON-LD@context定義内で定義される。

source: Within a Link, the rel property provides the link relation value.
ja: Link内では、rel属性がリンク関係の値を提供する。

source: Within the JSON serialization, they are expressed as either (1) a single JSON string or (2) a JSON object mapping well-formed [BCP47] Language-Tags to localized, equivalent translations of the same string value.
ja: JSON シリアル化の中で、これらは以下のどちらかで表現される: (1) 単一の JSON 文字列、または (2) 同じ文字列値の地域化された等価な翻訳への整形された [BCP47] Language-Tags にマッピングされたJSONオブジェクト。

source: or (b) any of the types included in the value of the type property are defined as extensions of Link (see Mention for instance); otherwise the JSON object is considered an instance or extension of Object.
ja: または (b) type 属性の値が、Link の拡張として定義されている型 (例えば、 Mention を参照のこと); さもなければこの JSON オブジェクトは Object の実体または 拡張である。

source: profile: The profile parameter for the application/activity+json media type allows one or more profile URIs to be specified.
ja: profile: application/activity+json メディアタイプの profile 引数は 一つ以上のプロファイル URI を指定できる。
